{"count":29,"next":null,"previous":null,"results":[{"code":"HH897G","name":"","biography":null,"submissions":["ZVGTTP"],"avatar":"","answers":[]},{"code":"SHTSXS","name":"Adriana Kobylak","biography":"Adriana is a Software Engineer at IBM that has been working on the OpenBMC project since its creation. She maintains the OpenBMC repositories that manage the firmware update process, and the meta-ibm yocto layer in the OpenBMC project.","submissions":["3LGYWA"],"avatar":"","answers":[]},{"code":"SJMDQU","name":"Allan Jude","biography":"CTO and co-Founder of [Klara Inc.](https://klarasystems.com/), Allan has been a part of the FreeBSD community since 1999 and an active participant in the OpenZFS community since 2013. The co-author of \"[FreeBSD Mastery: ZFS](https://mwl.io/nonfiction/os#fmzfs)\" and \"[FreeBSD Mastery: Advanced ZFS](https://mwl.io/nonfiction/os#fmaz)\", Allan is an expert in operating systems and storage.","submissions":["KL8MEH"],"avatar":"https://talks.osfc.io/media/avatars/allan_2015_full_boPgtDN.jpg","answers":[]},{"code":"TVYBFQ","name":"Cliff L. Biffle","biography":"Cliff would like the world to be filled with more robust firmware. He's working to provide more tools and techniques for achieving that, mostly by moving away from the memory-unsafe languages that account for most security bugs in shipping software.\r\n\r\nCliff is not here representing his employer, but he currently writes firmware and tools for Oxide Computer Company, and has previously done embedded systems work at Loon and assorted other projects at Google X.","submissions":["CPWTDH"],"avatar":"https://talks.osfc.io/media/avatars/face3_pYB5UPg.jpg","answers":[]},{"code":"ZCVRUT","name":"Daniel Hansson","biography":"Mainly embedded software developer. Now developing the security key - TKey, at Tillitis. Previously developed products in the IoT domain.","submissions":["3ZH38E"],"avatar":"","answers":[]},{"code":"V9XHZH","name":"Daniel Maslowski","biography":"I like giving [talks and workshops](https://metaspora.org).\r\n\r\nIn my free time, I work on free and open source software, especially operating systems and distributions, bringup and application firmware, with a focus on tooling, integration, and documentation.\r\n\r\nI created [Fiedka, the firmware editor](https://fiedka.app).","submissions":["UPU3PX"],"avatar":"https://talks.osfc.io/media/avatars/dan_haqEXgp.jpg","answers":[]},{"code":"MCSZBX","name":"Daniel Schaefer","biography":"Software/firmware engineer at Framework Computer Working on all sorts of code running on the laptops, be it operating system applications, drivers, BIOS applications, keyboard firmware, embedded controller firmware and more.","submissions":["ZUENEX"],"avatar":"https://talks.osfc.io/media/avatars/face_KjrQCJR.jpg","answers":[]},{"code":"XDFFXD","name":"Elyes Zekri","biography":"PhD/Engineer in Computer Sciences, currently working as Engineering Manager at Scaleway, a french Cloud Service Provider.\r\nPassionate about design and development of IT systems with a particular interest in embedded systems, firmware and hardware management.","submissions":["DMHDAE"],"avatar":"https://talks.osfc.io/media/avatars/20220806_1954352_1AtWuCJ.jpg","answers":[]},{"code":"J3LAW3","name":"Fredrik Stromberg","biography":"Fredrik's main interest is the design and construction of more trustworthy computer systems.\r\n\r\nTogether with his colleagues and collaborators he works on the open-source projects System Transparency, Sigsum and Tillitis TKey. A decade and a half ago he co-founded Mullvad VPN. His interest in computer security, strategy and creativity started a decade before that. He's a fourth-generation business owner and a third-generation inventor.","submissions":["U999DX"],"avatar":"","answers":[]},{"code":"SXPWMA","name":"Gunnar Mills","biography":"Gunnar Mills is a Senior Software Engineer at IBM working on the OpenBMC project. Gunnar maintains four OpenBMC repositories, including webui-vue and bmcweb, OpenBMC's web-based user interface and web server, respectively.","submissions":["MPTDXW"],"avatar":"https://talks.osfc.io/media/avatars/Gunner_MEEFJQg.jpeg","answers":[]},{"code":"8LTDWV","name":"Jean-Marie Verdun","biography":"I am thrilled by computers. I spent a lot of time designing them at architectural and hardware level, and participated to crazy projects, including building up the biggest european super computer in the late 90's. I love to share my knowledge and enable people to design better computers. I am particularly focused on open technologies currently, which includes design tools like FreeCAD, KiCAD, and open source firmware projects like linuxboot and OpenBMC. I used to work for big companies, created a french based startup that I successfully sold to an american company in 2018. I am now part of HPE mainly focused on open platforms. What does it mean will be known in a couple of months / quarters and years.","submissions":["DMHDAE"],"avatar":"https://talks.osfc.io/media/avatars/github_Re8KLUg.png","answers":[]},{"code":"PHJDAB","name":"Jeffrey Booher-Kaeding","biography":"Jeff works as a Systems Architecture Engineer in the Arm Architecture and Technology Group. Jeff has worked with a variety of open source projects in the areas firmware, server manageability, and the Arm SystemReady certification program.","submissions":["ZVGTTP"],"avatar":"https://talks.osfc.io/media/avatars/EC1N3FNEA-WG72TJDAN-da2e7fe4689e-512_uUMY793.jpeg","answers":[]},{"code":"K7LB7J","name":"Jens Drenhaus","biography":"Jens is Firmware Developer at 9elemtents Cyber Security","submissions":["RNRGRP"],"avatar":"","answers":[]},{"code":"HBH3LS","name":"Jian Zhang","biography":null,"submissions":["R7YBYN"],"avatar":"","answers":[]},{"code":"AGTCZS","name":"Julius Werner","biography":"I am a tech lead for Arm firmware and firmware security in Google's ChromeOS team and have been working on Chromebook firmware for over 10 years. I am also an active maintainer in the coreboot and Trusted Firmware projects.","submissions":["R3T8ZC"],"avatar":"https://talks.osfc.io/media/avatars/photo_Julius_Werner-1563293210_j4Oiozr.jpg","answers":[]},{"code":"P3YZPJ","name":"Laura Abbott","biography":"Laura is a software engineer with experience in low level systems. Her past\r\nwork has focused on the Linux kernel in areas ranging from memory management\r\nto kernel maintainership. She was a member of the Linux Foundation\r\nTechnical Advisory Board from 2018 to 2022. Laura's current role is at Oxide Computer\r\nfocusing on software in Rust for microcontrollers.","submissions":["QADUFW"],"avatar":"","answers":[]},{"code":"CLZREE","name":"Lei Yu","biography":"Firmware engineer at ByteDance.\r\nOpen Source Enthusiast","submissions":["R7YBYN"],"avatar":"https://talks.osfc.io/media/avatars/photo_Profile_LeiYU-1563292345_JJ7Fg7F.jpg","answers":[]},{"code":"NFAN9C","name":"Martin L Roth","biography":null,"submissions":["BDAC7F"],"avatar":"","answers":[]},{"code":"QQ7GAK","name":"Mathias Brossard","biography":"Mathias Brossard is a Principal Security Architect at Arm.","submissions":["HB8RGL"],"avatar":"https://talks.osfc.io/media/avatars/240e2ca0b50f4c22e8c02dd64a6f1618_NFV6OJt.jpg","answers":[]},{"code":"8UBJEN","name":"Matt Keeter","biography":"Matt Keeter is an embedded software engineer at Oxide Computer Company, where he works on bare-metal firmware, debug tools, and system integration.  He previously worked at Formlabs, a 3D printing startup, in a variety of roles – from desktop software to electrical engineering to tech lead – as the company grew from 12 to 600 people.  His work has been featured on the Sparkfun and Hackaday blogs, and published in ACM Transactions on Graphics.  He is based in Cambridge, MA; when not wrangling embedded systems, he enjoys rock climbing and writing weird GPU code.","submissions":["9TTFZF"],"avatar":"https://talks.osfc.io/media/avatars/unnamed_moFs0Q5.jpg","answers":[]},{"code":"F7LMHA","name":"Michael 'MC' Cardell Widerkrantz","biography":"MC is an applied researcher and programmer working with software on open hardware and helping defining the hardware/software interface at Tillitis.","submissions":["3ZH38E"],"avatar":"https://talks.osfc.io/media/avatars/mc-tastatur_cPRumHt.jpg","answers":[]},{"code":"DR3PNA","name":"Milo-D","biography":"CCCCC CCCCC CCCCC CCCCCCCCCC CCCCCCCCCCCCCCCCCCCC","submissions":["ZVGTTP"],"avatar":"","answers":[]},{"code":"AKYRDV","name":"Patrick Williams","biography":"Patrick is a software engineer currently at Meta where he leads their BMC software team.  He has worked on systems management firmware at various companies for a long time.  Patrick was one of the founding developers of the OpenBMC project and is a primary maintainer.","submissions":["8L8MAR","7TP7HD"],"avatar":"","answers":[]},{"code":"DJUHG7","name":"Ritvi Mishra","biography":"Ritvi Mishra is a multifaceted artist, maker, and firmware engineer who is passionate about creating beautiful and functional works of art. With a background in IoT and firmware engineering, she brings a unique blend of technical and creative skills to her work. Ritvi is known for her expertise in stained glass art, macrame, and other forms of artistic expression. She runs art workshops that encourage self-expression and creativity, inspiring others to explore their own artistic talents.\r\nIn her free time, Ritvi has recently become obsessed with scuba diving and other water sports. She is always looking for new challenges and ways to push her limits, both in and out of the water. As a maker at heart, Ritvi is proud of her extensive plier collection and her small but mighty maker setup. She believes that anyone can tap into their inner artist with the right tools and guidance, and she loves nothing more than sharing her knowledge and expertise with others.\r\nRitvi's unique background and diverse skill set make her a dynamic and engaging speaker. Whether she's discussing the intersection of technology and art, or sharing her experiences as a scuba diving enthusiast, she brings a contagious energy and enthusiasm to everything she does.","submissions":["XAZ7TP","XLE9JA"],"avatar":"https://talks.osfc.io/media/avatars/4a721f7522de6ddaa7899590d710fd6e_JaumntN.jpg","answers":[]},{"code":"PXYCVC","name":"Sasko Simonovski","biography":"Sasko has a background as hardware developer and over 20 years of experience of working within the telecom and IoT space. Today he is CEO of Tillitis.","submissions":["ARZF8L"],"avatar":"","answers":[]},{"code":"RWLPF8","name":"Simon Glass","biography":"Simon Glass has worked in embedded systems for many years, at ARM, Bluewater Systems (which he founded) and Google. In ChromeOS, Simon is responsible for driving adoption of Open Source firmware components in the industry ecosystem. He is a primary contributor to U-Boot and custodian of its driver model, with around 8000 commits in total. Simon is married with three children and lives in Colorado.","submissions":["DER7ZC"],"avatar":"https://talks.osfc.io/media/avatars/me2019_T6sTFeU.jpg","answers":[]},{"code":"LPSNB9","name":"Vagrant Cascadian","biography":"Vagrant Cascadian works on the Reproducible Builds project and\r\nmaintains packages of several Open Source Firmwares in the Debian\r\nproject, including u-boot, trustedfirmware and opensbi. Vagrant spends\r\nother free time fiddling with an open hardware based solar\r\nphotovoltaic system and getting thrown around as an aikidoist.","submissions":["HYSNUF"],"avatar":"https://talks.osfc.io/media/avatars/vagrantupsidedown_WMqLsy8.png","answers":[]},{"code":"ZSJDEA","name":"Varshit Pandya","biography":"Firmware Engineer, passionate about all things firmware and open source.","submissions":["BDAC7F"],"avatar":"","answers":[]},{"code":"AQF8VK","name":"ronald g. minnich","biography":"Ron Minnich has been working in Unix kernels since 1976. Along the way, he started the LinuxBIOS, a.k.a. coreboot; oreboot; u-root (u-root.org); LinuxBoot; and other projects. He is currently employed as a Senior Principle Engineer in the Systems Research Lab at Samsung Advanced Institute of Technolgy.","submissions":["PUMRQ9"],"avatar":"https://talks.osfc.io/media/avatars/Ron-Minnich_aQJJhae.jpg","answers":[]}]}